#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_alb.this will be created
  + resource "aws_alb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "nodejs-app-dev-load-balancer"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags_all                   = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_alb_listener.this will be created
  + resource "aws_alb_listener" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 3000
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_alb_target_group.this will be created
  + resource "aws_alb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "nodejs-app-dev-target-group"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_appautoscaling_policy.down will be created
  + resource "aws_appautoscaling_policy" "down" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "nodejs-app-dev_scale_down"
      + policy_type        = "StepScaling"
      + resource_id        = "service/nodejs-app-dev-cluster/nodejs-app-dev-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # aws_appautoscaling_policy.up will be created
  + resource "aws_appautoscaling_policy" "up" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "nodejs-app-dev_scale_up"
      + policy_type        = "StepScaling"
      + resource_id        = "service/nodejs-app-dev-cluster/nodejs-app-dev-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 60
          + metric_aggregation_type = "Maximum"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 1
            }
        }
    }

  # aws_appautoscaling_target.this will be created
  + resource "aws_appautoscaling_target" "this" {
      + id                 = (known after apply)
      + max_capacity       = 5
      + min_capacity       = 2
      + resource_id        = "service/nodejs-app-dev-cluster/nodejs-app-dev-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/ecs/nodejs-app-dev"
      + retention_in_days = 5
      + tags              = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "nodejs-app-dev-log-group"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "nodejs-app-dev"
        }
      + tags_all          = {
          + "CreatedAt" = "2020-05-17"
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "nodejs-app-dev-log-group"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "nodejs-app-dev"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
    }

  # aws_cloudwatch_metric_alarm.service_cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "service_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "nodejs-app-dev_cpu_utilization_high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "nodejs-app-dev-cluster"
          + "ServiceName" = "nodejs-app-dev-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.service_cpu_low will be created
  + resource "aws_cloudwatch_metric_alarm" "service_cpu_low" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_name                            = "nodejs-app-dev_cpu_utilization_low"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "nodejs-app-dev-cluster"
          + "ServiceName" = "nodejs-app-dev-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + threshold                             = 10
      + treat_missing_data                    = "missing"
    }

  # aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "nodejs-app-dev-repository"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
    }

  # aws_ecs_cluster.this will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "nodejs-app-dev-cluster"
      + tags_all = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "nodejs-app-dev-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "nodejs-app-dev-container"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = (known after apply)
      + family                   = "nodejs-app-dev-task-definition"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags_all                 = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
    }

  # aws_eip.this[0] will be created
  + resource "aws_eip" "this" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + vpc                  = true
    }

  # aws_eip.this[1] will be created
  + resource "aws_eip" "this" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + vpc                  = true
    }

  # aws_iam_role.ecs_auto_scale_role will be created
  + resource "aws_iam_role" "ecs_auto_scale_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "application-autoscaling.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "EcsAutoScaleRole"
      + path                  = "/"
      + tags_all              = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "EcsTaskExecutionRole"
      + path                  = "/"
      + tags_all              = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ecs_auto_scale_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_auto_scale_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceAutoscaleRole"
      + role       = "EcsAutoScaleRole"
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "EcsTaskExecutionRole"
    }

  # aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "Terraform ECS IGW"
        }
      + tags_all = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Name"      = "Terraform ECS IGW"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags_all             = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
    }

  # aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags_all             = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
    }

  # aws_route.internet_access will be created
  + resource "aws_route" "internet_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "allow inbound access from the ALB only"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3000
            },
        ]
      + name                   = "nodejs-app-dev-ecs-tasks-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.lb will be created
  + resource "aws_security_group" "lb" {
      + arn                    = (known after apply)
      + description            = "controls access to the ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3000
            },
        ]
      + name                   = "nodejs-app-dev-load-balancer-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-central-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.1.0.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags_all                        = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-central-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.1.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags_all                        = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-central-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.1.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags_all                        = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-central-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.1.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags_all                        = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.1.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "Terraform ECS VPC "
        }
      + tags_all                         = {
          + "CreatedAt" = "2020-05-17"
          + "ManagedBy" = "Terraform"
          + "Name"      = "Terraform ECS VPC "
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate"
        }
    }

  # null_resource.docker will be created
  + resource "null_resource" "docker" {
      + id       = (known after apply)
      + triggers = {
          + "app_md5" = "8aba303bc16f5e9639f53a7de5feb37a"
        }
    }

Plan: 35 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_url             = (known after apply)
  + cluster_arn         = (known after apply)
  + cluster_name        = "nodejs-app-dev-cluster"
  + ecs_service_id      = (known after apply)
  + log_group           = (known after apply)
  + repository_name     = "nodejs-app-dev-repository"
  + repository_url      = (known after apply)
  + task_definition_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```
</details>

*Pusher: @chgasparoto, Action: `pull_request`, Working Directory: `06-ecs-fargate/terraform/service`, Workflow: `Create terraform plan`*